<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during custom for various
    | messages that we need to display to the user
    |
    */

    /*
    |--------------------------------------------------------------------------
    | Common Custom Message
    |--------------------------------------------------------------------------
    */

    'common' => [
        'somethingWentWrong' => 'কিছু ভুল হয়েছে!',
        'activeUserMiddleware' => 'আপনার অ্যাকাউন্ট সাময়িকভাবে নিষ্ক্রিয় রয়েছে এবং আপনি লগ আউট হয়ে গিয়েছেন।',
        "account"                       => "অ্যাকাউন্ট",
        "search_placeholder"                => "অনুসন্ধান করুন...",
        "No_Records_Found"                  => "কোন তথ্য পাওয়া যায়নি!",
        "Showing_Up"                        => "প্রদর্শন",
        "client_name"                       => "সদস্য",
        "acc_no"                            => "অ্যাকাউন্ট নং",
        "acc_details"                       => "অ্যাকাউন্টের বিবরণ",
        "initial_balance"                   => "প্রাথমিক ব্যালেন্স",
        "field"                             => "ফিল্ড",
        "center"                            => "কেন্দ্র",
        "field_id"                          => "ফিল্ড",
        "center_id"                         => "কেন্দ্র",
        "creator_id"                        => "নির্মাতা",
        "category_id"                       => "ক্যাটাগরি",
        "group"                             => "গ্রুপ",
        "officer"                           => "অফিসার",
        "time"                              => "সময়",
        "date"                              => "তারিখ",
        "description"                       => "বর্ণনা",
        "deposit"                           => "জমা",
        "loan"                              => "ঋণ",
        "loan_saving"                       => "ঋণ সঞ্চয়",
        "saving"                            => "সঞ্চয়",
        "interest"                          => "লাভ",
        "withdrawal"                        => "উত্তোলন",
        "total"                             => "মোট",
        "total_installment"                 => "মোট কিস্তি",
        "start_date"                        => "শুরু করার তারিখ",
        "duration_date"                     => "সময়কাল তারিখ",
        "payable_deposit"                   => "প্রদেয় জমা",
        "payable_installment"               => "প্রদেয় কিস্তি",
        "payable_interest"                  => "প্রদেয় লাভ",
        "total_deposit_without_interest"    => "লাভ ছাড়া মোট আমানত",
        "total_deposit_with_interest"       => "লাভ সহ মোট আমানত",
        "name"                              => "নাম",
        "email"                             => "ইমেল",
        "password"                          => "পাসওয়ার্ড",
        "confirm_password"                  => "পাসওয়ার্ড নিশ্চিত করুন",
        "role"                              => "ভূমিকা",
        "father_name"                       => "পিতার নাম",
        "husband_name"                      => "স্বামীর নাম",
        "mother_name"                       => "মায়ের নাম",
        "nid"                               => "জন্ম নিবন্ধন নং/ভোটার আইডি নং",
        "dob"                               => "জন্ম তারিখ",
        "occupation"                        => "পেশা",
        "relation"                          => "সম্পর্ক",
        "religion"                          => "ধর্ম",
        "gender"                            => "লিঙ্গ",
        "primary_phone"                     => "প্রাথমিক ফোন নম্বর",
        "secondary_phone"                   => "অনাবশ্যক ফোন নাম্বার",
        "share"                             => "শেয়ার",
        "annual_income"                     => "বাৎসরিক আয়",
        "bank_acc_no"                       => "ব্যাংক একাউন্ট নম্বর",
        "bank_check_no"                     => "চেক নম্বর",
        "address"                           => "ঠিকানা",
        "present_address"                   => "বর্তমান ঠিকানা",
        "permanent_address"                 => "স্থায়ী ঠিকানা",
        "street_address"                    => "বাড়ি/অ্যাপার্টমেন্ট/রাস্তা",
        "city"                              => "গ্রাম/শহর",
        "word_no"                           => "ওয়ার্ড/ইউনিয়ন নম্বর",
        "post_office"                       => "পোস্ট অফিস",
        "post_code"                         => "পোস্ট কোড",
        "police_station"                    => "থানা",
        "district"                          => "জেলা",
        "division"                          => "বিভাগ",
        "phone"                             => "মুঠোফোন",
        "image"                             => "ছবি",
        "status"                            => "স্ট্যাটাস",
        "toggle_status"                     => "টগল স্ট্যাটাস",
        "action"                            => "পদক্ষেপ",
        "registration"                      => "নিবন্ধন",
        "closing"                           => "ক্লোজিং",
        "cancel"                            => "বাতিল করুণ",
        "create"                            => "তৈরি করুণ",
        "verified_at"                       => "যাচাই করা হয়েছে",
        "pending"                           => "অপেক্ষারত",
        "deleted"                           => "মুছে ফেলা হয়েছে!",
        "delete"                            => "মুছে ফেলুন",
        "edit"                              => "সম্পাদন করুন",
        "update"                            => "আপডেট",
        "select"                            => "নির্বাচন করুন",
        "creator"                           => "নির্মাতা",
        "created_at"                        => "নিবন্ধন হয়েছে",
        "updated_at"                        => "সর্বশেষ আপডেট",
        "min"                               => "সর্বনিম্ন",
        "max"                               => "সর্বোচ্চ",
        "day"                               => "দিন",
        "balance"                           => "ব্যালেন্স",
        "previous_balance"                  => "পূর্বের ব্যালেন্স",
        "total_deposit"                     => "সর্বমোট জমা",
        "total_withdraw"                    => "সর্বমোট উত্তোলন",
        "amount"                            => "পরিমাণ",
        "category"                          => "ক্যাটাগরি",
        "today"                             => "আজ",
        "yesterday"                         => "গতকাল",
        "last_7days"                        => "গত ৭ দিন",
        "last_30days"                       => "গত ৩০ দিন",
        "last_365days"                      => "গত ৩৬৫ দিন",
        "last_month"                        => "গত মাস",
        "last_year"                         => "গত বছর",
        "this_month"                        => "এই মাস",
        "this_year"                         => "এই বছর",
        "transaction"                       => "লেনদেন",
        "send_money"                        => "টাকা পাঠিয়েছে",
        "received_money"                    => "টাকা এসেছে",
        "income"                            => "আয়",
        "expense"                           => "ব্যয়",
        "fee"                               => "ফি",
        "store"                             => "জমা",
        "limit"                             => "লিমিট",
        "configuration"                     => "কনফিগারেশন",
        "male"                              => "পুরুষ",
        "female"                            => "মহিলা",
        "others"                            => "অন্যান্য",
        "islam"                             => "ইসলাম",
        "hindu"                             => "হিন্দু",
        "christian"                         => "খ্রিস্টান",
        "Buddhist"                          => "বৌদ্ধ",
        "open_signature_pad"                => "স্বাক্ষর প্যাড খুলুন",
        "signature_pad"                     => "স্বাক্ষর প্যাড",
        "signature"                         => "স্বাক্ষর",
        "approval"                          => "অনুমোদন",
        "saving_info"                       => "সঞ্চয় তথ্য",
        "nominee_info"                      => "নমিনির তথ্য",
        "add_nominee"                       => "নমিনি যোগ করুন",
        "remove_nominee"                    => "নমিনি বিয়োগ দিন",
        "nominee"                           => "নমিনি"
    ],

    /*
    |--------------------------------------------------------------------------
    | Authozation Custom Message
    |--------------------------------------------------------------------------
    */
    'authorize' => [
        'successful' => 'অনুমোদন সফল হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Login Custom Message
    |--------------------------------------------------------------------------
    */

    'login' => [
        'successful' => 'লগইন সফল হয়েছে।',
        'incorrectEmail' => 'ইমেলটি ভুল।',
        'incorrectPassword' => 'পাসওয়ার্ডটি ভুল।',
        'accDeactivate' => 'আপনার অ্যাকাউন্ট সাময়িকভাবে নিষ্ক্রিয় রয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Logout Custom Message
    |--------------------------------------------------------------------------
    */
    'logout' => [
        'successful' => 'লগআউট সফল হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Password Change Custom Message
    |--------------------------------------------------------------------------
    */
    'passwordChange' => [
        'successful' => 'পাসওয়ার্ড পরিবর্তন করা হয়েছে',
        'notMatch' => 'বর্তমান পাসওয়ার্ড মেলেনি।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Forgot Password Custom Message
    |--------------------------------------------------------------------------
    */
    'forgotPassword' => [
        'successful' => 'আপনার ইমেল ঠিকানায় ওটিপি পাঠানো হয়েছে। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'accountNotFound' => 'অ্যাকাউন্ট পাওয়া যায়নি।',
    ],

    /*
    |--------------------------------------------------------------------------
    | OTP Verification Custom Message
    |--------------------------------------------------------------------------
    */
    'otp' => [
        'successful' => 'অ্যাকাউন্ট সফলভাবে যাচাই করা হয়েছে।',
        'otpSent' => 'আপনাকে আপনার ইমেল ঠিকানা যাচাই করতে হবে। আমরা ইতিমধ্যেই আপনার ইমেল ঠিকানায় একটি OTP পাঠিয়েছি। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'otpResend' => 'পুনরায় আপনার ইমেল ঠিকানায় একটি OTP পাঠিয়েছি। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'otpIsInvalid' => 'ওটিপি অবৈধ!',
        'otpIsExpired' => 'ওটিপি মেয়াদ শেষ!',
    ],

    /*
    |--------------------------------------------------------------------------
    | Reset Password Custom Message
    |--------------------------------------------------------------------------
    */
    'resetPassword' => [
        'successful' => 'পাসওয়ার্ড পুনরায় সেট করা হয়েছে৷।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Field Custom Message
    |--------------------------------------------------------------------------
    */
    'field' => [
        'successful'        => 'ফিল্ড সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'ফিল্ড সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'ফিল্ড তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'ফিল্ড স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Center Custom Message
    |--------------------------------------------------------------------------
    */
    'center' => [
        'successful'        => 'কেন্দ্র সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'কেন্দ্র সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'কেন্দ্র তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'কেন্দ্র স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Category Custom Message
    |--------------------------------------------------------------------------
    */
    'category' => [
        'successful'        => 'বিভাগ/শ্রেণী সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'বিভাগ/শ্রেণী সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'বিভাগ/শ্রেণী তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'বিভাগ/শ্রেণী স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Staff Custom Message
    |--------------------------------------------------------------------------
    */
    'staff' => [
        'successful'        => 'কর্মকর্তা সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'কর্মকর্তা সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'কর্মকর্তার তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'কর্মকর্তার স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
        'profile_update'    => 'প্রোফাইল তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Role Custom Message
    |--------------------------------------------------------------------------
    */
    'role' => [
        'successful'    => 'ভূমিকা সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'        => 'ভূমিকা সফলভাবে মুছে ফেলা হয়েছে।',
        'update'        => 'ভূমিকা সফলভাবে পরিবর্তন করা হয়েছে।',
    ],
    /*
    |--------------------------------------------------------------------------
    | Permission Custom Message
    |--------------------------------------------------------------------------
    */
    'permission' => [
        'update'        => 'কর্মকর্তার অনুমতি সফলভাবে পরিবর্তন করা হয়েছে।',
    ],
    /*
    |--------------------------------------------------------------------------
    | App Config Custom Message
    |--------------------------------------------------------------------------
    */
    'app_config' => [
        'app_settings_update'               => 'অ্যাপ সেটিংস সফলভাবে পরিবর্তন করা হয়েছে।',
        'approval_configuration_update'     => 'অনুমোদন সফলভাবে আপডেট করা হয়েছে।',
        'categories_configuration_update'   => 'বিভাগ/শ্রেণী অনুমোদন সফলভাবে আপডেট করা হয়েছে।',
        'transfer_transaction_update'       => 'অর্থ স্থানান্তর অনুমোদন সফলভাবে আপডেট করা হয়েছে।',
    ],
    /*
    |--------------------------------------------------------------------------
    | Account Management Custom Message
    |--------------------------------------------------------------------------
    */
    'accounts' => [
        'successful'        => 'অ্যাকাউন্ট সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'অ্যাকাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'অ্যাকাউন্ট তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'অ্যাকাউন্ট স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Income Categories Custom Message
    |--------------------------------------------------------------------------
    */
    'income_category' => [
        'successful'        => 'আয় বিভাগ সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'আয় বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'আয় বিভাগ তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'আয় বিভাগ স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',

        'default'           => [
            'registration_fee'                  => 'নিবন্ধন ফি',
            'closing_fee'                       => 'ক্লোজিং ফি',
            'withdrawal_fee'                    => 'উত্তোলন ফি',
            'money_transfer_transaction_fee'    => 'অর্থ স্থানান্তর ফি'
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Income Custom Message
    |--------------------------------------------------------------------------
    */
    'income' => [
        'successful'        => 'আয় সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'আয় সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'আয় তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Expense Categories Custom Message
    |--------------------------------------------------------------------------
    */
    'expense_category' => [
        'successful'        => 'ব্যয় বিভাগ সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'ব্যয় বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'ব্যয় বিভাগ তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'ব্যয় বিভাগ স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',

        'default'           => [
            'electricity_bill'  => 'বিদ্যুৎ বিল',
            'office_rent'       => 'অফিস ভাড়া',
            'daily_expense'     => 'দৈনিক খরচ'
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Expense Custom Message
    |--------------------------------------------------------------------------
    */
    'expense' => [
        'successful'        => 'ব্যয় সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'ব্যয় সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'ব্যয় তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Account Withdrawal Custom Message
    |--------------------------------------------------------------------------
    */
    'account_withdrawal' => [
        'successful'        => 'উত্তোলন সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'উত্তোলন সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'উত্তোলন তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Account Transfer Custom Message
    |--------------------------------------------------------------------------
    */
    'account_transfer' => [
        'successful'        => 'টাকা স্থানান্তর সফলভাবে হয়েছে।',
        'delete'            => 'টাকা স্থানান্তর সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'টাকা স্থানান্তর তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Client Custom Message
    |--------------------------------------------------------------------------
    */
    'client' => [
        /*
        |--------------------------------------------------------------------------
        | Client registration Custom Message
        |--------------------------------------------------------------------------
        */
        'registration' => [
            'successful'        => 'সদস্য প্রোফাইল সফলভাবে হয়েছে।',
            'update'            => 'সদস্য প্রোফাইল তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
            'delete'            => 'সদস্য প্রোফাইল সফলভাবে মুছে ফেলা হয়েছে।',
            'p_delete'          => 'সদস্য প্রোফাইল স্থায়ীভাবে মুছে ফেলা হয়েছে।',
            'approved'          => 'সদস্য প্রোফাইল সফলভাবে আনুমোদিত করা হয়েছে।',
        ],

        /*
        |--------------------------------------------------------------------------
        | Saving registration Custom Message
        |--------------------------------------------------------------------------
        */
        'saving' => [
            'successful'        => 'সঞ্চয় একাউন্ট সফলভাবে হয়েছে।',
            'update'            => 'সঞ্চয় একাউন্ট তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
            'delete'            => 'সঞ্চয় একাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
            'p_delete'          => 'সঞ্চয় একাউন্ট স্থায়ীভাবে মুছে ফেলা হয়েছে।',
            'approved'          => 'সঞ্চয় একাউন্ট সফলভাবে আনুমোদিত করা হয়েছে।',
        ],

        /*
        |--------------------------------------------------------------------------
        | Loan registration Custom Message
        |--------------------------------------------------------------------------
        */
        'loan' => [
            'successful'        => 'ঋণ একাউন্ট সফলভাবে হয়েছে।',
            'update'            => 'ঋণ একাউন্ট তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
            'delete'            => 'ঋণ একাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
            'p_delete'          => 'ঋণ একাউন্ট স্থায়ীভাবে মুছে ফেলা হয়েছে।',
            'approved'          => 'ঋণ একাউন্ট সফলভাবে আনুমোদিত করা হয়েছে।',
        ],
    ],

];
