<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during custom for various
    | messages that we need to display to the user
    |
    */

    /*
    |--------------------------------------------------------------------------
    | Common Custom Message
    |--------------------------------------------------------------------------
    */

    'common' => [
        'somethingWentWrong' => 'কিছু ভুল হয়েছে!',
        'activeUserMiddleware' => 'আপনার অ্যাকাউন্ট সাময়িকভাবে নিষ্ক্রিয় রয়েছে এবং আপনি লগ আউট হয়ে গিয়েছেন।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Authozation Custom Message
    |--------------------------------------------------------------------------
    */
    'authorize' => [
        'successful' => 'অনুমোদন সফল হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Login Custom Message
    |--------------------------------------------------------------------------
    */

    'login' => [
        'successful' => 'লগইন সফল হয়েছে।',
        'incorrectEmail' => 'ইমেলটি ভুল।',
        'incorrectPassword' => 'পাসওয়ার্ডটি ভুল।',
        'accDeactivate' => 'আপনার অ্যাকাউন্ট সাময়িকভাবে নিষ্ক্রিয় রয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Logout Custom Message
    |--------------------------------------------------------------------------
    */
    'logout' => [
        'successful' => 'লগআউট সফল হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Password Change Custom Message
    |--------------------------------------------------------------------------
    */
    'passwordChange' => [
        'successful' => 'পাসওয়ার্ড পরিবর্তন করা হয়েছে',
        'notMatch' => 'বর্তমান পাসওয়ার্ড মেলেনি।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Forgot Password Custom Message
    |--------------------------------------------------------------------------
    */
    'forgotPassword' => [
        'successful' => 'আপনার ইমেল ঠিকানায় ওটিপি পাঠানো হয়েছে। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'accountNotFound' => 'অ্যাকাউন্ট পাওয়া যায়নি।',
    ],

    /*
    |--------------------------------------------------------------------------
    | OTP Verification Custom Message
    |--------------------------------------------------------------------------
    */
    'otp' => [
        'successful' => 'অ্যাকাউন্ট সফলভাবে যাচাই করা হয়েছে।',
        'otpSent' => 'আপনাকে আপনার ইমেল ঠিকানা যাচাই করতে হবে। আমরা ইতিমধ্যেই আপনার ইমেল ঠিকানায় একটি OTP পাঠিয়েছি। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'otpResend' => 'পুনরায় আপনার ইমেল ঠিকানায় একটি OTP পাঠিয়েছি। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'otpIsInvalid' => 'ওটিপি অবৈধ!',
        'otpIsExpired' => 'ওটিপি মেয়াদ শেষ!',
    ],

    /*
    |--------------------------------------------------------------------------
    | Reset Password Custom Message
    |--------------------------------------------------------------------------
    */
    'resetPassword' => [
        'successful' => 'পাসওয়ার্ড পুনরায় সেট করা হয়েছে৷।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Field Custom Message
    |--------------------------------------------------------------------------
    */
    'field' => [
        'successful'        => 'ফিল্ড সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'ফিল্ড সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'ফিল্ড তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'ফিল্ড স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Center Custom Message
    |--------------------------------------------------------------------------
    */
    'center' => [
        'successful'        => 'কেন্দ্র সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'কেন্দ্র সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'কেন্দ্র তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'কেন্দ্র স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Category Custom Message
    |--------------------------------------------------------------------------
    */
    'category' => [
        'successful'        => 'বিভাগ/শ্রেণী সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'বিভাগ/শ্রেণী সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'বিভাগ/শ্রেণী তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'বিভাগ/শ্রেণী স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Staff Custom Message
    |--------------------------------------------------------------------------
    */
    'staff' => [
        'successful'        => 'কর্মকর্তা সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'কর্মকর্তা সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'কর্মকর্তার তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'কর্মকর্তার স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
        'profile_update'    => 'প্রোফাইল তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Role Custom Message
    |--------------------------------------------------------------------------
    */
    'role' => [
        'successful'    => 'ভূমিকা সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'        => 'ভূমিকা সফলভাবে মুছে ফেলা হয়েছে।',
        'update'        => 'ভূমিকা সফলভাবে পরিবর্তন করা হয়েছে।',
    ],
    /*
    |--------------------------------------------------------------------------
    | Permission Custom Message
    |--------------------------------------------------------------------------
    */
    'permission' => [
        'update'        => 'কর্মকর্তার অনুমতি সফলভাবে পরিবর্তন করা হয়েছে।',
    ],
    /*
    |--------------------------------------------------------------------------
    | App Config Custom Message
    |--------------------------------------------------------------------------
    */
    'app_config' => [
        'app_settings_update'               => 'অ্যাপ সেটিংস সফলভাবে পরিবর্তন করা হয়েছে।',
        'approval_configuration_update'     => 'অনুমোদন সফলভাবে আপডেট করা হয়েছে।',
        'categories_configuration_update'   => 'বিভাগ/শ্রেণী অনুমোদন সফলভাবে আপডেট করা হয়েছে।',
        'transfer_transaction_update'       => 'অর্থ স্থানান্তর অনুমোদন সফলভাবে আপডেট করা হয়েছে।',
    ],
    /*
    |--------------------------------------------------------------------------
    | Account Management Custom Message
    |--------------------------------------------------------------------------
    */
    'accounts' => [
        'successful'        => 'অ্যাকাউন্ট সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'অ্যাকাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'অ্যাকাউন্ট তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'অ্যাকাউন্ট স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Income Categories Custom Message
    |--------------------------------------------------------------------------
    */
    'income_category' => [
        'successful'        => 'আয় বিভাগ সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'আয় বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'আয় বিভাগ তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'আয় বিভাগ স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',

        'default'           => [
            'registration_fee'                  => 'নিবন্ধন ফি',
            'closing_fee'                       => 'ক্লোজিং ফি',
            'withdrawal_fee'                    => 'উত্তোলন ফি',
            'money_transfer_transaction_fee'    => 'অর্থ স্থানান্তর ফি'
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Income Custom Message
    |--------------------------------------------------------------------------
    */
    'income' => [
        'successful'        => 'আয় সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'আয় সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'আয় তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Expense Categories Custom Message
    |--------------------------------------------------------------------------
    */
    'expense_category' => [
        'successful'        => 'ব্যয় বিভাগ সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'ব্যয় বিভাগ সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'ব্যয় বিভাগ তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
        'status'            => 'ব্যয় বিভাগ স্ট্যাটাস সফলভাবে পরিবর্তন করা হয়েছে।',

        'default'           => [
            'electricity_bill'  => 'বিদ্যুৎ বিল',
            'office_rent'       => 'অফিস ভাড়া',
            'daily_expense'     => 'দৈনিক খরচ'
        ]
    ],

    /*
    |--------------------------------------------------------------------------
    | Expense Custom Message
    |--------------------------------------------------------------------------
    */
    'expense' => [
        'successful'        => 'ব্যয় সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'ব্যয় সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'ব্যয় তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Account Withdrawal Custom Message
    |--------------------------------------------------------------------------
    */
    'account_withdrawal' => [
        'successful'        => 'উত্তোলন সফলভাবে নিবন্ধিত হয়েছে।',
        'delete'            => 'উত্তোলন সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'উত্তোলন তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Account Transfer Custom Message
    |--------------------------------------------------------------------------
    */
    'account_transfer' => [
        'successful'        => 'টাকা স্থানান্তর সফলভাবে হয়েছে।',
        'delete'            => 'টাকা স্থানান্তর সফলভাবে মুছে ফেলা হয়েছে।',
        'update'            => 'টাকা স্থানান্তর তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Client Custom Message
    |--------------------------------------------------------------------------
    */
    'client' => [
        /*
        |--------------------------------------------------------------------------
        | Client registration Custom Message
        |--------------------------------------------------------------------------
        */
        'registration' => [
            'successful'        => 'সদস্য প্রোফাইল সফলভাবে হয়েছে।',
            'update'            => 'সদস্য প্রোফাইল তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
            'delete'            => 'সদস্য প্রোফাইল সফলভাবে মুছে ফেলা হয়েছে।',
            'p_delete'          => 'সদস্য প্রোফাইল স্থায়ীভাবে মুছে ফেলা হয়েছে।',
            'approved'          => 'সদস্য প্রোফাইল সফলভাবে আনুমোদিত করা হয়েছে।',
        ],

        /*
        |--------------------------------------------------------------------------
        | Saving registration Custom Message
        |--------------------------------------------------------------------------
        */
        'saving' => [
            'successful'        => 'সঞ্চয় একাউন্ট সফলভাবে হয়েছে।',
            'update'            => 'সঞ্চয় একাউন্ট তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
            'delete'            => 'সঞ্চয় একাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
            'p_delete'          => 'সঞ্চয় একাউন্ট স্থায়ীভাবে মুছে ফেলা হয়েছে।',
            'approved'          => 'সঞ্চয় একাউন্ট সফলভাবে আনুমোদিত করা হয়েছে।',
        ],

        /*
        |--------------------------------------------------------------------------
        | Loan registration Custom Message
        |--------------------------------------------------------------------------
        */
        'loan' => [
            'successful'        => 'ঋণ একাউন্ট সফলভাবে হয়েছে।',
            'update'            => 'ঋণ একাউন্ট তথ্য সফলভাবে পরিবর্তন করা হয়েছে।',
            'delete'            => 'ঋণ একাউন্ট সফলভাবে মুছে ফেলা হয়েছে।',
            'p_delete'          => 'ঋণ একাউন্ট স্থায়ীভাবে মুছে ফেলা হয়েছে।',
            'approved'          => 'ঋণ একাউন্ট সফলভাবে আনুমোদিত করা হয়েছে।',
        ],
    ],

];
