<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during custom for various
    | messages that we need to display to the user
    |
    */

    /*
    |--------------------------------------------------------------------------
    | Common Custom Message
    |--------------------------------------------------------------------------
    */

    'common' => [
        'somethingWentWrong' => 'কিছু ভুল হয়েছে!',
    ],

    /*
    |--------------------------------------------------------------------------
    | Login Custom Message
    |--------------------------------------------------------------------------
    */

    'login' => [
        'successfull' => 'লগইন সফল হয়েছে।',
        'incorrectEmail' => 'ইমেলটি ভুল।',
        'incorrectPassword' => 'পাসওয়ার্ডটি ভুল।',
        'otpSend' => 'আপনাকে আপনার ইমেল ঠিকানা যাচাই করতে হবে। আমরা ইতিমধ্যেই আপনার ইমেল ঠিকানায় একটি OTP পাঠিয়েছি। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'accDeactivate' => 'আপনার অ্যাকাউন্ট সাময়িক ভাবে বন্ধ রয়েছে।',
    ]

];
