<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Custom Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used during custom for various
    | messages that we need to display to the user
    |
    */

    /*
    |--------------------------------------------------------------------------
    | Common Custom Message
    |--------------------------------------------------------------------------
    */

    'common' => [
        'somethingWentWrong' => 'কিছু ভুল হয়েছে!',
    ],

    /*
    |--------------------------------------------------------------------------
    | Login Custom Message
    |--------------------------------------------------------------------------
    */

    'login' => [
        'successfull' => 'লগইন সফল হয়েছে।',
        'incorrectEmail' => 'ইমেলটি ভুল।',
        'incorrectPassword' => 'পাসওয়ার্ডটি ভুল।',
        'otpSend' => 'আপনাকে আপনার ইমেল ঠিকানা যাচাই করতে হবে। আমরা ইতিমধ্যেই আপনার ইমেল ঠিকানায় একটি OTP পাঠিয়েছি। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'accDeactivate' => 'আপনার অ্যাকাউন্ট সাময়িক ভাবে বন্ধ রয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Logout Custom Message
    |--------------------------------------------------------------------------
    */
    'logout' => [
        'successfull' => 'লগআউট সফল হয়েছে।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Password Change Custom Message
    |--------------------------------------------------------------------------
    */
    'passwordChange' => [
        'successfull' => 'পাসওয়ার্ড পরিবর্তন করা হয়েছে',
        'notMatch' => 'বর্তমান পাসওয়ার্ড মেলেনি।',
    ],

    /*
    |--------------------------------------------------------------------------
    | Forgot Password Custom Message
    |--------------------------------------------------------------------------
    */
    'forgotPassword' => [
        'successfull' => 'আপনার ইমেল ঠিকানায় ওটিপি পাঠানো হয়েছে। আপনার ইমেল ইনবক্স বা স্প্যাম ফোল্ডার চেক করুন।',
        'accountNotFound' => 'অ্যাকাউন্ট পাওয়া যায়নি।',
    ],

    /*
    |--------------------------------------------------------------------------
    | OTP Verification Custom Message
    |--------------------------------------------------------------------------
    */
    'otp' => [
        'successfull' => 'অ্যাকাউন্ট সফলভাবে যাচাই করা হয়েছে।',
        'otpIsInvalid' => 'ওটিপি অবৈধ!',
        'otpIsExpired' => 'ওটিপি মেয়াদ শেষ!',
    ]

];
